# DuctPressureDropService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..DuctPressureDropService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which permits registration of an alternate implementation for duct pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctPressureDropServer.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId DuctPressureDropService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuctPressureDropService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ DuctPressureDropService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace